Revit 2024 API
PanelScheduleView.SetSpareLoadValue Method
 Sets the value of the apparent load parameter for a spare
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetSpareLoadValue(
	int row,
	int column,
	ElementId idLoadParameter,
	double value
)
Visual Basic
Public Sub SetSpareLoadValue ( _
	row As Integer, _
	column As Integer, _
	idLoadParameter As ElementId, _
	value As Double _
)
Visual C++
public:
void SetSpareLoadValue(
	int row,
	int column,
	ElementId^ idLoadParameter,
	double value
)
Parameters
row
Type: System.Int32
 A row where the valid spare is
column
Type: System.Int32
 A column where the valid spare is
idLoadParameter
Type: Autodesk.Revit.DB.ElementId
 One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
value
Type: System.Double
 The value of the spare's load for the given parameter
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The load parameter id is not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for value must be non-negative.
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  The row column combination does not represent a valid spare.
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace